html-reports/load/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 14887,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.407603949754819,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 162.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 11.0,
    "throughput" : 83.08961421682444,
    "receivedKBytesPerSec" : 52.33179805406099,
    "sentKBytesPerSec" : 10.08509209931461
  },
  "01 - Product List" : {
    "transaction" : "01 - Product List",
    "sampleCount" : 4980,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.45220883534137,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 162.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 11.0,
    "throughput" : 27.795141989641007,
    "receivedKBytesPerSec" : 32.843868952603145,
    "sentKBytesPerSec" : 3.2300995085617967
  },
  "02 - Search Products" : {
    "transaction" : "02 - Search Products",
    "sampleCount" : 4962,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.395002015316397,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 41.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 11.0,
    "throughput" : 27.799098013949973,
    "receivedKBytesPerSec" : 9.807900125003501,
    "sentKBytesPerSec" : 3.6072384292977393
  },
  "03 - Product Detail" : {
    "transaction" : "03 - Product Detail",
    "sampleCount" : 4945,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.3753286147623944,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 41.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 11.539999999999964,
    "throughput" : 27.785425715425546,
    "receivedKBytesPerSec" : 9.782223780489518,
    "sentKBytesPerSec" : 3.2832387808266517
  }
}